Tekla Open API Reference for Tekla Structures 2025
BinaryFilterExpressionCollection.SyncRoot Property
 Gets the root for synchronization.
 Namespace: Tekla.Structures.Filtering
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Object SyncRoot { get; }
Public ReadOnly Property SyncRoot As Object
	Get
Property Value
Type: Object
See Also
Reference
BinaryFilterExpressionCollection Class
Tekla.Structures.Filtering Namespace